// Слоги для каждого звука
export const syllables = {
  "hard-r": ["РА", "РО", "РУ", "РЫ", "РЭ"],
  "soft-r": ["РЯ", "РЁ", "РЮ", "РИ", "РЕ"],
  "hard-l": ["ЛА", "ЛО", "ЛУ", "ЛЫ", "ЛЭ"],
  "soft-l": ["ЛЯ", "ЛЁ", "ЛЮ", "ЛИ", "ЛЕ"],
  "hard-s": ["СА", "СО", "СУ", "СЫ", "СЭ"],
  "soft-s": ["СЯ", "СЁ", "СЮ", "СИ", "СЕ"],
  "hard-z": ["ЗА", "ЗО", "ЗУ", "ЗЫ", "ЗЭ"],
  "soft-z": ["ЗЯ", "ЗЁ", "ЗЮ", "ЗИ", "ЗЕ"],
  "hard-sh": ["ША", "ШО", "ШУ", "ШИ", "ШЕ"],
  "hard-zh": ["ЖА", "ЖО", "ЖУ", "ЖИ", "ЖЕ"],
  "soft-shch": ["ЩА", "ЩО", "ЩУ", "ЩИ", "ЩЕ"]
};

export const getSyllables = (soundId) => {
  return syllables[soundId] || [];
};
